In [4]:
import pandas as pd
import sqlite3

In [5]:
#Conectar con la base de datos existente
conn = sqlite3.connect('../sql/supply_chain.db')

In [6]:
#Consultar las columnas de la tabla (Consultar columnas, tipo de datos, nulos y pk)
query = "PRAGMA table_info(inventario);"
pd.read_sql_query(query, conn)

    cid                     name     type  notnull dflt_value  pk
0     0             Product type     TEXT        0       None   0
1     1                      SKU     TEXT        0       None   0
2     2                    Price     REAL        0       None   0
3     3             Availability  INTEGER        0       None   0
4     4  Number of products sold  INTEGER        0       None   0
5     5        Revenue generated     REAL        0       None   0
6     6    Customer demographics     TEXT        0       None   0
7     7             Stock levels  INTEGER        0       None   0
8     8               Lead times  INTEGER        0       None   0
9     9         Order quantities  INTEGER        0       None   0
10   10           Shipping times  INTEGER        0       None   0
11   11        Shipping carriers     TEXT        0       None   0
12   12           Shipping costs     REAL        0       None   0
13   13            Supplier name     TEXT        0       None   0
14   14                 Location     TEXT        0       None   0
15   15                Lead time  INTEGER        0       None   0
16   16       Production volumes  INTEGER        0       None   0
17   17  Manufacturing lead time  INTEGER        0       None   0
18   18      Manufacturing costs     REAL        0       None   0
19   19       Inspection results     TEXT        0       None   0
20   20             Defect rates     REAL        0       None   0
21   21     Transportation modes     TEXT        0       None   0
22   22                   Routes     TEXT        0       None   0
23   23                    Costs     REAL        0       None   0

In [7]:
#Consultar las primeras 10 filas de datos
query = "SELECT * FROM inventario LIMIT 10;"
pd.read_sql_query(query, conn)

,Product type,SKU,Price,Availability,Number of products sold,Revenue generated,Customer demographics,Stock levels,Lead times,Order quantities,...,Location,Lead time,Production volumes,Manufacturing lead time,Manufacturing costs,Inspection results,Defect rates,Transportation modes,Routes,Costs
0,haircare,SKU0,69.808006,55,802,8661.996792,Non-binary,58,7,96,...,Mumbai,29,215,29,46.279879,Pending,0.226410,Road,Route B,187.752075
1,skincare,SKU1,14.843523,95,736,7460.900065,Female,53,30,37,...,Mumbai,23,517,30,33.616769,Pending,4.854068,Road,Route B,503.065579
2,haircare,SKU2,11.319683,34,8,9577.749626,Unknown,1,10,88,...,Mumbai,12,971,27,30.688019,Pending,4.580593,Air,Route C,141.920282
3,skincare,SKU3,61.163343,68,83,7766.836426,Non-binary,23,13,59,...,Kolkata,24,937,18,35.624741,Fail,4.746649,Rail,Route A,254.776159
4,skincare,SKU4,4.805496,26,871,2686.505152,Non-binary,5,3,56,...,Delhi,5,414,3,92.065161,Fail,3.145580,Air,Route A,923.440632
5,haircare,SKU5,1.699976,87,147,2828.348746,Non-binary,90,27,66,...,Bangalore,10,104,17,56.766476,Fail,2.779194,Road,Route A,235.461237
6,skincare,SKU6,4.078333,48,65,7823.476560,Male,11,15,58,...,Kolkata,14,314,24,1.085069,Pending,1.000911,Sea,Route A,134.369097
7,cosmetics,SKU7,42.958384,59,426,8496.103813,Female,93,17,11,...,Bangalore,22,564,1,99.466109,Fail,0.398177,Road,Route C,802.056312
8,cosmetics,SKU8,68.717597,78,150,7517.363211,Female,5,10,15,...,Mumbai,13,769,8,11.423027,Pending,2.709863,Sea,Route B,505.557134
9,skincare,SKU9,64.015733,35,980,4971.145988,Unknown,14,27,83,...,Chennai,29,963,23,47.957602,Pending,3.844614,Rail,Route B,995.929461

In [8]:
#Consultar la cantidad de filas
query = "SELECT COUNT(*) FROM inventario"
pd.read_sql_query(query,conn)

   COUNT(*)
0       100

In [9]:
#Consultar valores únicos
query = "SELECT DISTINCT [Product type] FROM inventario"
pd.read_sql_query(query, conn)

  Product type
0     haircare
1     skincare
2    cosmetics

In [10]:
query = '''
SELECT [Product type], COUNT(*) AS total_productos
FROM inventario
GROUP BY [Product type]
ORDER BY total_productos DESC
'''
pd.read_sql_query(query,conn)

  Product type  total_productos
0     skincare               40
1     haircare               34
2    cosmetics               26

In [14]:
query = '''
SELECT 
    SKU,
    [Number of products sold], 
    [Stock levels],
    [Number of products sold] / [Stock levels] AS 'rotation'
FROM inventario
'''
pd.read_sql_query(query,conn)

      SKU  Number of products sold  Stock levels  rotation
0    SKU0                      802            58      13.0
1    SKU1                      736            53      13.0
2    SKU2                        8             1       8.0
3    SKU3                       83            23       3.0
4    SKU4                      871             5     174.0
..    ...                      ...           ...       ...
95  SKU95                      672            15      44.0
96  SKU96                      324            67       4.0
97  SKU97                       62            46       1.0
98  SKU98                      913            53      17.0
99  SKU99                      627            55      11.0

[100 rows x 4 columns]

In [16]:
query = '''
SELECT
    [Product type],
    SUM([Number of products sold]) AS total_sold, 
    SUM([Stock levels]) AS stock_total,
    SUM([Number of products sold]) * 1.0 / SUM([Stock levels]) AS rotation_media
FROM inventario
GROUP BY [Product type]
ORDER BY total_sold DESC
'''
pd.read_sql_query(query,conn)

  Product type  total_sold  stock_total  rotation_media
0     skincare       20731         1608       12.892413
1     haircare       13611         1644        8.279197
2    cosmetics       11757         1525        7.709508